app/controllers/posts_controller.rb

  def new
    if params[:author_id] && !Author.exists?(params[:author_id])
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Asdfasd"], ["description", "asdfasdfasdf"], ["author_id", 1], ["created_at", "2016-02-01 05:49:17.037502"], ["updated_at", "2016-02-01 05:49:17.037502"]]

    def edit
    if params[:author_id]
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        @post = author.posts.find_by(id: params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]